tutorials/rectangle/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 305.0;

boundaryField
{
      inlet                  { type fixedValue; value $internalField;}
      outlet			           { type zeroGradient;}
      walls  			           { type zeroGradient;}

    "procBoundary.*"
    {
        type processor;
        value $internalField;
    }
}

// ************************************************************************* //
