tutorials/rectangle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

//to have the same resolution as FS:
nx      1;
ny      300;
nz      35;
xMin    0.0;
xMax    0.001;
yMin    0.0;
yMax    0.06;
zMin    0.0;
zMax    0.007;

blocks
(
    hex (0  1  2  3  4  5  6  7) ($nx $ny $nz) simpleGrading (1 1 1)
);

vertices
(
    ($xMin   $yMin   $zMin)
    ($xMax   $yMin   $zMin)
    ($xMax   $yMax   $zMin)
    ($xMin   $yMax   $zMin)

    ($xMin   $yMin   $zMax)
    ($xMax   $yMin   $zMax)
    ($xMax   $yMax   $zMax)
    ($xMin   $yMax   $zMax)
);

boundary               
(
    inlet              
    {
        type patch;    
        faces
        (
            (0 4 7 3)  
        );
    }                  

    outlet             
    {
        type patch;    
        faces
        (
            (1 2 6 5)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (0 3 2 1)
            (3 7 6 2)
            (4 5 6 7)
        );
    }
); 


// ************************************************************************* //
