tutorials/rectangle/system/cellMin
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out the minimum cell value for one or more fields.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/functions/volFieldValue/cellMin.cfg"

fields ( U p T rho k nut H2 H O2 O OH H2O HO2 H2O2 N2 LMA Qdot);

// ************************************************************************* //
