tutorials/rectangle/system/cutPlaneSurface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out cut-plane surface files with interpolated field data in VTK
    format.

\*---------------------------------------------------------------------------*/

//#includeEtc "caseDicts/functions/surface/cutPlaneSurface.cfg"

// ************************************************************************* //

  type            surfaces;
  libs            ("libsampling.so");
  writeControl    adjustableRunTime;
  writeInterval   1e-4;
  surfaceFormat   vtk;
  fields ( U p T rho k nut H2 H O2 O OH H2O HO2 H2O2 N2 LMA Qdot vorticity);
  interpolationScheme     cellPoint;
  surfaces
  (
          yNormal
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.1 0 0);
                  normal  (0 1 0);
                  interpolate true;
          }
          yzNormal3
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.1 0 0);
                  normal  (0 0 1);
                  interpolate true;
          }
          yzNormal
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.1 0 0);
                  normal  (0 1 1);
                  interpolate true;
          }
          yzNormal2
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.1 0 0);
                  normal  (0 1 -1);
                  interpolate true;
          }
          xNormal0
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.0243 0 0);
                  normal  (1 0 0);
                  interpolate true;
          }
          xNormal1
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.028 0 0);
                  normal  (1 0 0);
                  interpolate true;
          }
          xNormal2
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.04 0 0);
                  normal  (1 0 0);
                  interpolate true;
          }
          xNormal3
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.0475 0 0);
                  normal  (1 0 0);
                  interpolate true;
          }
          xNormal4
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.0603 0 0);
                  normal  (1 0 0);
                  interpolate true;
          }
          xNormal5
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.0819 0 0);
                  normal  (1 0 0);
                  interpolate true;
          }
          xNormal6
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.1035 0 0);
                  normal  (1 0 0);
                  interpolate true;
          }
          xNormal7
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.1251 0 0);
                  normal  (1 0 0);
                  interpolate true;
          }
          xNormal8
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.1467 0 0);
                  normal  (1 0 0);
                  interpolate true;
          }
          xNormal9
          {
                  type        cutPlane;
                  planeType   pointAndNormal;
                  point   (0.1683 0 0);
                  normal  (1 0 0);
                  interpolate true;
          }
);

// ************************************************************************* //


